'''Task 5
Напишіть функцію, яка переводить число, що означає кількість доларів і центів, в прописний формат. Наприклад:
> 123,34
> one hundred twenty three dollars thirty four cents'''

def my_func(a:float):

    a1 =["один", "два", "три", "чотири", "п'ять", "шість", "сім", "вісім", "дев'ять", "десять", "одинадцять", "дванадцять",
        "тринадцять", "чотирнадцять", "п'ятнадцять", "шістнадцять", "сімнадцять", "вісімнадцять", "дев'ятнадцять",
        'двадцять', ""]
    a2 =["двадцять", "тридцять", "сорок", "п'ятдесят", "шістдесят", "сімдесят", "вісімдесят", "дев'яносто"]
    a3 = ["", "сто", "двісті", "триста", "чотириста", "п'ятсот", "шістсот", "сімсот", "вісімсот", "дев'ятсот"]

    dollar = int(a)
    cent = int ((a-dollar) * 100)

    if dollar <= 20:
        dollars = a1[dollar-1] + ' долар(а/и/ів)'
    elif dollar <= 99:
        dollars = a2[dollar // 10 - 2] + ' ' + a1[dollar % 10 - 1] + ' долар(а/и/ів)'
    else:
        hundreds = a3[dollar // 100]
        rest = dollar % 100
        if rest == 0:
            dollars = hundreds + ' долар(а/и/ів)'
        elif rest <= 20:
            dollars = hundreds + ' ' + a1[rest - 1] + ' долар(а/и/ів)'
        else:
            dollars = hundreds + ' ' + a2[rest // 10 - 2] + ' ' + a1[rest % 10 - 1] + ' долар(а/и/ів)'

    if cent == 0:
        cents = "нуль центів"
    elif cent == 1:
        cents = "один цент"
    elif cent <= 20:
        cents = a1[cent - 1] + " центів"
    else:
        cents = a2[cent // 10 - 2] + ' ' + a1[cent % 10 - 1] + " центів"
    return f'введена сума - {dollars}   {cents}'
a = float(input('введи сумму доларів у форматі ХХ.XX - '))
print(my_func(a))